export const revalidate = false; // صفحه استاتیک

import Link from "next/link";
import styles from "./GymExperiencePage.module.css";
import Image from "next/image";

export const metadata = {
  title: "تجربیات من در بدنسازی",
  description: "مسیر و تجربیات شخصی من در دنیای بدنسازی",
};

export default function GymExperiencePage() {
  const experiences = [
    {
      id: 1,
      title: "شروع مسیر",
      text: "از ۱۶ سالگی وارد دنیای بدنسازی شدم. اوایل همه‌چیز برام جدید بود و خیلی از حرکات رو اشتباه اجرا می‌کردم. اما کم‌کم با تحقیق و سرچ کردن تونستم فرم صحیح تمرین‌ها رو یاد بگیرم. بزرگ‌ترین اشتباه من توی همون شش ماه اول این بود که اصلاً به رژیم غذایی توجهی نداشتم. فکر می‌کردم فقط با تمرین میشه پیشرفت کرد، اما واقعیت اینه که ۸۰ درصد بدنسازی توی آشپزخونه شکل می‌گیره، نه فقط توی باشگاه. به خاطر همین هم توی اون مدت نتیجه خاصی نگرفتم.",
      img: "/images/skinny.png",
    },
    {
      id: 2,
      title: "پیشرفت و یادگیری",
      text: "با گذر زمان و مطالعه بیشتر فهمیدم که راز اصلی تغییر بدن توی تغذیه‌ست. بدنسازی فقط وزنه زدن نیست، بازی با کالریه! شما باید بدونید چه مقدار کالری نیاز دارید و مهم‌تر از اون اینکه این کالری از چه منابعی بیاد. خیلی فرق داره که کالری‌تون رو از غذای باکیفیت بگیرید یا از نوشابه و خوراکی‌های بی‌ارزش. نمی‌تونید بگید چون نوشابه کالری داره پس بخورم و پیشرفت کنم! کیفیت غذا همون‌قدر مهمه که مقدارش. اینجاست که یاد گرفتم تغذیه‌ی اصولی می‌تونه مسیر رشد رو چند برابر سریع‌تر کنه",
      img: "/images/amin2.png",
    },
    {
      id: 3,
      title: "امروز",
      text: "امروز که دارم این سایت رو شخصاً طراحی می‌کنم، وقتی به عقب نگاه می‌کنم می‌بینم از ۴۰ کیلو به ۷۲ کیلو رسیدم. توی این چهار سال پر از پستی و بلندی بوده، پر از ناامیدی و دوباره بلند شدن. مسیر رسیدن به بدن رویاهات اصلاً آسون نیست؛ سخته، طاقت‌فرساست و نیاز به دیسیپلین و انضباط جدی داره. اما نتیجه‌اش فوق‌العاده لذت‌بخشه. اگر واقعاً مصمم باشی و روی تصمیمت بمونی، می‌تونی به چیزی برسی که تصورش رو می‌کنی. من این مسیر رو رفتم و می‌دونم چقدر چالش داره، برای همین خوشحال می‌شم اگر بخوای توی این راه کنارت باشم و کمکت کنم",
      img: "/images/amin3.png",
    },
  ];

  return (
    <div className={styles.container}>
      <h1 className={styles.title}>تجربیات مرادی در بدنسازی💪</h1>

      <div className={styles.cards}>
        {experiences.map((exp) => (
          <div key={exp.id} className={styles.card}>
            <div className={styles.imageWrapper}>
              <Image
                src={exp.img}
                alt={exp.title}
                width={500}
                height={300}
                className={styles.image}
              />
            </div>
            <div className={styles.content}>
              <h2>{exp.title}</h2>
              <p>{exp.text}</p>
            </div>
          </div>
        ))}
      </div>
      <Link className={styles.contact} href={"/contact"}>ارتباط با من برای شروع🔥</Link>
    </div>
  );
}
